cache/posts/object-relational-mapping.html
<p>
So basically the idea of object relational mapping is the one of
mapping relational tables to objects.
</p>

<p>
The idea is that a lot of times the application logic is in objects
while the persistency layer is in the relational schema.
</p>

<p>
That translation is annoying and time consuming. Plus it requires a
mind switch to think at the two different levels.
</p>

<p>
The idea of this technology was essentially to develop a framework to
map the relational persistency layer to the ORM paradigm. In such a
way it is possible for the developer to wire his mind into a single
setting - the one of the objects and to properly develop in a pure
object oriented mind.
</p>

<p>
In this sense this is a lot what is happening in the NoSQL space,
especially with the document store and the json communication format
for API.. the underlying driver must is the same&#x2026;. avoid all of that
annoying conversions from one paradigm to the other.
</p>

<p>
So you see it always think in terms of concepts&#x2026; you will anticipate
the future once you focus on the underlying driver and force instead
of on the concept itself.
</p>

<p>
In general much of these notes refer to the <a href="https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjbwuWh_eH4AhVDwQIHHW0vC9sQFnoECA8QAQ&amp;url=https%3A%2F%2Fhoclaptrinhdanang.com%2Fdownloads%2Fpdf%2Fspring%2FJava%2520Persistence%2520with%2520Hibernate.pdf&amp;usg=AOvVaw0524Xl7sPIrS85z5EARMyP">following book</a>.
</p>

<!-- TEASER_END -->


<div id="outline-container-orgfec9e30" class="outline-2">
<h2 id="orgfec9e30">Important Concepts leading to ORM</h2>
<div class="outline-text-2" id="text-orgfec9e30">
<p>
So this is very important.
</p>

<p>
It must sit in a very important way in your brain.
</p>

<p>
Cause this topic is very hot in the team and it is at least good
that you have an understanding of going into one direction or the
other.
</p>

<p>
So interesting to see is that much of the topics discussed that
follow come from thinking in terms of objects and the respective
shortcoming when going 
</p>
</div>


<div id="outline-container-orgc2e7897" class="outline-3">
<h3 id="orgc2e7897">Problem of Granularity</h3>
<div class="outline-text-3" id="text-orgc2e7897">
<p>
The idea is that in the OOP world you have lots of level of
granularity through which you can create and shape your objects.
</p>

<p>
These are very important as through them you can create very
sophisticated business logic.
</p>

<p>
Now when working with SQL the point is essentially that such
<i>level of granularity is lost</i>.
</p>

<p>
It is generally not a big practice to work with <code>user-defined data
    types</code> in SQL relational DBs. You generally work at two level of
granularity - tables and columns with the SQL standard data
types. 
</p>

<p>
The key now is essentially the following:
</p>

<blockquote>
<p>
Many simple persistence mechanisms fail to recognize this mismatch and
so end up forcing the less flexible representation of SQL products on
the object-oriented model, effectively flattening it.
</p>
</blockquote>
</div>

<div id="outline-container-orgd1433c6" class="outline-4">
<h4 id="orgd1433c6"><span class="todo TODO">TODO</span> the book claims for a solution to the above problem - find it and integrate it here then.</h4>
</div>
</div>

<div id="outline-container-org242e4a9" class="outline-3">
<h3 id="org242e4a9">The problem of Subtypes</h3>
</div>

<div id="outline-container-orgd79d6a4" class="outline-3">
<h3 id="orgd79d6a4"></h3>
</div>

<div id="outline-container-org334a580" class="outline-3">
<h3 id="org334a580"></h3>
</div>
</div>
